{"classifications":[{"id":"45b6f55cc5dab8ff","name":"Impatiens hawkeri","probability":0.99,"details":{"common_names":["New Guinea Impatiens"],"description":{"value":"Impatiens hawkeri, the New Guinea impatiens, is a species of flowering plant in the family Balsaminaceae. It is native to Papua New Guinea and the Solomon Islands. It has been bred and hybridized in cultivation to produce a line of garden plants.","citation":"https://en.wikipedia.org/wiki/Impatiens_hawkeri","license_name":"CC BY-SA 3.0","license_url":"https://creativecommons.org/licenses/by-sa/3.0/"},"synonyms":["Impatiens herzogii","Impatiens klossii","Impatiens lauterbachii","Impatiens linearifolia","Impatiens mooreana","Impatiens nivea","Impatiens polyphylla","Impatiens rodatzii","Impatiens schlechteri","Impatiens trichura"],"watering":{"max":2,"min":2},"best_light_condition":"This plant thrives in bright, indirect light. It can tolerate some direct sunlight, especially in the morning or late afternoon, but too much direct sun can scorch the leaves. If grown indoors, placing it near a north or east-facing window is ideal. In outdoor settings, a spot with dappled shade or filtered sunlight works best. Avoid placing it in deep shade, as this can lead to poor growth and fewer blooms.","best_soil_type":"A well-draining, rich soil mix is ideal for this plant. A combination of potting soil with added organic matter like compost or peat moss works well. The soil should retain some moisture but not stay soggy. Good aeration is also important, so adding perlite or sand can help improve drainage. If planting in a garden bed, ensure the soil is loose and fertile.","best_watering":"Watering should be done consistently to keep the soil evenly moist but not waterlogged. It's important to water the plant at the base to avoid wetting the foliage, which can lead to fungal diseases. During the growing season, regular watering is crucial, but in the winter months, you can reduce the frequency. Always check the top inch of soil; if it feels dry, it's time to water. Using a well-draining pot or soil mix can help prevent root rot.","language":"en","entity_id":"45b6f55cc5dab8ff"}}],"diseases":[{"id":"e5eed7f688efa59e","name":"water excess or uneven watering","probability":0.0903,"details":{"description":"Water excess and uneven watering are abiotic disorders caused by inadequate watering. Water excess may lead to rotting of the roots due to lack of oxygen, and higher susceptibility to infection. Symptoms of over-watering include stunted growth, yellow and brown leaves, wilting and higher susceptibility to leaf burn.","common_names":["overwatering"],"language":"en","entity_id":"e5eed7f688efa59e"}},{"id":"5b5b0081922d3c45","name":"finished flowering period","probability":0.0891,"details":{"description":"The finished flowering period is part of the physiological process when the flowers die at the end of the flowering period. If fertilized, flowers develop into fruits.","common_names":null,"language":"en","entity_id":"5b5b0081922d3c45"}},{"id":"bf75abeaaafd6c6f","name":"feeding damage by insects","probability":0.073,"details":{"description":"Feeding damage by insects includes holes or notches in leaves, removal of the tissue between leaf veins, tunnels in the plant tissue, root consumption, and others.","common_names":null,"language":"en","entity_id":"bf75abeaaafd6c6f"}},{"id":"af7b78782de52bd8","name":"senescence","probability":0.07,"details":{"description":"Senescence is a process of aging that can occur due to physiological aging or environmental stress.","common_names":["aging"],"language":"en","entity_id":"af7b78782de52bd8"}},{"id":"d24ebab7c0155e4b","name":"Animalia","probability":0.0325,"details":{"description":"Disorders induced by organisms from the animal kingdom. These pests cause direct damage by feeding on leaves, stems, roots, and other parts of the plant or by inhabiting plant tissues. Pests can also spread bacterial and viral diseases.","common_names":["pests"],"language":"en","entity_id":"d24ebab7c0155e4b"}},{"id":"3d0001192c1ae290","name":"light or heat source damage","probability":0.024,"details":{"description":"Exposition to a strong source of light or heat (such as a radiator, light bulb, fire) can be damaging to plants and lead to injuries, stunted growth, leaf drop, etc.","common_names":null,"language":"en","entity_id":"3d0001192c1ae290"}},{"id":"7f22438065988f95","name":"Fungi","probability":0.0237,"details":{"description":"Fungi take energy from the plants on which they live, causing damage to the plant. Fungal infections are responsible for approximately two-thirds of infectious plant diseases and cause wilting, molding, rusts, scabs, rotted tissue, and other problems.","common_names":null,"language":"en","entity_id":"7f22438065988f95"}}]}